# INdexing

In [13]:
import pandas as pd

In [14]:

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

data_frame2=pd.DataFrame(data)
data_frame2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

# Index can be adjust by self

In [15]:
#method 1
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

data_frame2=pd.DataFrame(data,index=["Names",123,"@","/","ABC","!"])  #set indexes
data_frame2

        state  year  pop
Names    Ohio  2000  1.5
123      Ohio  2001  1.7
@        Ohio  2002  3.6
/      Nevada  2001  2.4
ABC    Nevada  2002  2.9
!      Nevada  2003  3.2

In [16]:
# (#method 2  Without set the name of index)

In [17]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

data_frame2=pd.DataFrame(data,["Names",123,"@","/","ABC","!"])  #set indexes
data_frame2

        state  year  pop
Names    Ohio  2000  1.5
123      Ohio  2001  1.7
@        Ohio  2002  3.6
/      Nevada  2001  2.4
ABC    Nevada  2002  2.9
!      Nevada  2003  3.2

# Accessing the indexing

In [18]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

data_frame2=pd.DataFrame(data,["Names",123,"@","/","ABC","!"])  #set indexes
data_frame2

        state  year  pop
Names    Ohio  2000  1.5
123      Ohio  2001  1.7
@        Ohio  2002  3.6
/      Nevada  2001  2.4
ABC    Nevada  2002  2.9
!      Nevada  2003  3.2

# How to Access the rows
-  loc (its works on the string indexs of columns)
-  iloc (Its works on the integers indexs of the rows)

In [29]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four','five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [30]:
frame2.loc["one"]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [34]:
frame2.loc["six"]

year       2003
state    Nevada
pop         3.2
debt        NaN
Name: six, dtype: object

In [36]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

data_frame2=pd.DataFrame(data)  #set indexes
data_frame2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [38]:
data_frame2.iloc[0]

state    Ohio
year     2000
pop       1.5
Name: 0, dtype: object

# HEAD AND TAIL

In [39]:
data_frame2.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [41]:
data_frame2.tail(2)

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2